{"config": [{"config": {"activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 306, "mask_zero": false, "input_dim": 51867, "name": "embedding_1", "batch_input_shape": [null, 306], "dtype": "int32", "embeddings_constraint": null, "output_dim": 100, "trainable": false, "embeddings_regularizer": null}, "class_name": "Embedding"}, {"config": {"stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "recurrent_activation": "hard_sigmoid", "unroll": false, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null, "implementation": 0, "recurrent_constraint": null, "activation": "tanh", "bias_regularizer": null, "name": "gru_1", "return_sequences": false, "dropout": 0.6}, "class_name": "GRU"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_5", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_6", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 38, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}