{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_5", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "name": "dense_2", "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "scale": true, "center": true, "axis": -1, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 7, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "name": "dense_3", "use_bias": true}}], "class_name": "Sequential", "keras_version": "2.0.2"}