{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "kernel_constraint": null, "name": "conv2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_1"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_2"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "name": "conv2d_3", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "filters": 64, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_3"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "name": "conv2d_4", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "filters": 64, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_4"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "name": "conv2d_5", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "filters": 128, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_5"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "name": "conv2d_6", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "filters": 128, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_6"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.25}}, {"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear", "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_7"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.25}}, {"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear", "name": "dense_2", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_8"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "trainable": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.25}}, {"class_name": "Dense", "config": {"units": 7, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "dense_3", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}