{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 48, 48, 1], "activation": "linear", "data_format": "channels_last", "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_1"}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_2"}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_3"}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_4"}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_5"}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "name": "conv2d_6"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_6"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_6", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"units": 128, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_7"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_7", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"units": 128, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_8"}, "class_name": "LeakyReLU"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_8", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"units": 7, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential"}