{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 48, 48, 1], "name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_1", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_2", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_3", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_3", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_4", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_4", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_5", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_5", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_6", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 128, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_7", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 128, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.0010000000474974513}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_8", "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "softmax", "units": 7, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}], "backend": "tensorflow"}