{"backend": "tensorflow", "config": [{"config": {"activation": "linear", "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "name": "conv2d_1", "dilation_rate": [1, 1], "batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.0010000000474974513}, "class_name": "LeakyReLU"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.0010000000474974513}, "class_name": "LeakyReLU"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_1", "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"activation": "linear", "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 256, "name": "conv2d_3", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.0010000000474974513}, "class_name": "LeakyReLU"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 256, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.0010000000474974513}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 7, "name": "dense_2"}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}