{"config": [{"config": {"filters": 16, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 48, 48, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_1", "padding": "same", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 32, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_2", "padding": "same", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 32, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_3", "padding": "same", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_4", "padding": "same", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 64, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_5", "padding": "same", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_6", "padding": "same", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null, "units": 256, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_regularizer": null, "units": 7, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}