{"config": [{"config": {"use_bias": true, "batch_input_shape": [null, 48, 48, 1], "filters": 64, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU"}, {"config": {"axis": -1, "scale": true, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU"}, {"config": {"axis": -1, "scale": true, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "filters": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "name": "conv2d_3", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU"}, {"config": {"axis": -1, "scale": true, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU"}, {"config": {"axis": -1, "scale": true, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 0.0010000000474974513, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU"}, {"config": {"axis": -1, "scale": true, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_6", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 7, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}