{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["movieID", 0, 0], ["userID", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "movieID", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "movieID"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "userID", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "userID"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "embedding_1", "config": {"output_dim": 256, "mask_zero": false, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_dim": 3952, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "int32", "name": "embedding_1", "activity_regularizer": null, "input_length": 1, "embeddings_regularizer": null}, "inbound_nodes": [[["movieID", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "embedding_2", "config": {"output_dim": 256, "mask_zero": false, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_dim": 6040, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "int32", "name": "embedding_2", "activity_regularizer": null, "input_length": 1, "embeddings_regularizer": null}, "inbound_nodes": [[["userID", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "movie_bias", "config": {"output_dim": 1, "mask_zero": false, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_dim": 3952, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "int32", "name": "movie_bias", "activity_regularizer": null, "input_length": 1, "embeddings_regularizer": null}, "inbound_nodes": [[["movieID", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "users_bias", "config": {"output_dim": 1, "mask_zero": false, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_dim": 6040, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "int32", "name": "users_bias", "activity_regularizer": null, "input_length": 1, "embeddings_regularizer": null}, "inbound_nodes": [[["userID", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "dot_1", "config": {"name": "dot_1", "axes": 1, "normalize": false, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "class_name": "Dot"}, {"name": "flatten_3", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["movie_bias", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "flatten_4", "config": {"name": "flatten_4", "trainable": true}, "inbound_nodes": [[["users_bias", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "class_name": "Add"}, {"name": "dense_1", "config": {"use_bias": true, "bias_regularizer": null, "units": 1, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_1", "activity_regularizer": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.0.4"}