{"class_name": "Model", "config": {"output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 1], "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 1], "sparse": false, "name": "input_2"}, "name": "input_2"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 256, "embeddings_constraint": null, "batch_input_shape": [null, 1], "mask_zero": false, "dtype": "int32", "input_dim": 3952, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_length": 1, "name": "movie_vec", "trainable": true}, "name": "movie_vec"}, {"class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 256, "embeddings_constraint": null, "batch_input_shape": [null, 1], "mask_zero": false, "dtype": "int32", "input_dim": 6040, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_length": 1, "name": "user_vec", "trainable": true}, "name": "user_vec"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 15], "sparse": false, "name": "input_3"}, "name": "input_3"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 7], "sparse": false, "name": "input_4"}, "name": "input_4"}, {"class_name": "Flatten", "inbound_nodes": [[["movie_vec", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1"}, {"class_name": "Flatten", "inbound_nodes": [[["user_vec", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true}, "name": "flatten_2"}, {"class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 256, "embeddings_constraint": null, "batch_input_shape": [null, 15], "mask_zero": false, "dtype": "int32", "input_dim": 15, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_length": 15, "name": "title_vec", "trainable": true}, "name": "title_vec"}, {"class_name": "Embedding", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 256, "embeddings_constraint": null, "batch_input_shape": [null, 7], "mask_zero": false, "dtype": "int32", "input_dim": 7, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_length": 7, "name": "genre_vec", "trainable": true}, "name": "genre_vec"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "name": "dropout_1"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}, "name": "dropout_2"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 1, "embeddings_constraint": null, "batch_input_shape": [null, 1], "mask_zero": false, "dtype": "int32", "input_dim": 3952, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_length": 1, "name": "movie_bias", "trainable": true}, "name": "movie_bias"}, {"class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 1, "embeddings_constraint": null, "batch_input_shape": [null, 1], "mask_zero": false, "dtype": "int32", "input_dim": 6040, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_length": 1, "name": "user_bias", "trainable": true}, "name": "user_bias"}, {"class_name": "GRU", "inbound_nodes": [[["title_vec", 0, 0, {}]]], "config": {"recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "name": "gru_1", "bias_constraint": null, "activity_regularizer": null, "dropout": 0.7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "go_backwards": false, "stateful": false, "bias_regularizer": null, "implementation": 0, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "trainable": true}, "name": "gru_1"}, {"class_name": "GRU", "inbound_nodes": [[["genre_vec", 0, 0, {}]]], "config": {"recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "name": "gru_2", "bias_constraint": null, "activity_regularizer": null, "dropout": 0.7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "go_backwards": false, "stateful": false, "bias_regularizer": null, "implementation": 0, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "trainable": true}, "name": "gru_2"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 3], "sparse": false, "name": "input_5"}, "name": "input_5"}, {"class_name": "Dot", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "normalize": false, "name": "dot_1", "axes": 1}, "name": "dot_1"}, {"class_name": "Flatten", "inbound_nodes": [[["movie_bias", 0, 0, {}]]], "config": {"name": "flatten_3", "trainable": true}, "name": "flatten_3"}, {"class_name": "Flatten", "inbound_nodes": [[["user_bias", 0, 0, {}]]], "config": {"name": "flatten_4", "trainable": true}, "name": "flatten_4"}, {"class_name": "Dense", "inbound_nodes": [[["gru_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 1, "bias_constraint": null, "trainable": true}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["gru_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 1, "bias_constraint": null, "trainable": true}, "name": "dense_2"}, {"class_name": "Dense", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "other_features", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 128, "bias_constraint": null, "trainable": true}, "name": "other_features"}, {"class_name": "Add", "inbound_nodes": [[["dot_1", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "name": "add_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_3", "trainable": true}, "name": "dropout_3"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_4", "trainable": true}, "name": "dropout_4"}, {"class_name": "Dropout", "inbound_nodes": [[["other_features", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_5", "trainable": true}, "name": "dropout_5"}, {"class_name": "Concatenate", "inbound_nodes": [[["add_1", 0, 0, {}], ["dropout_3", 0, 0, {}], ["dropout_4", 0, 0, {}], ["dropout_5", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_3", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 1, "bias_constraint": null, "trainable": true}, "name": "dense_3"}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.4"}