{"config": {"layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 1], "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 1], "sparse": false}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 3952, "trainable": true, "mask_zero": false, "embeddings_constraint": null, "activity_regularizer": null, "name": "embedding_1", "batch_input_shape": [null, 1], "output_dim": 128, "dtype": "int32", "input_length": 1, "embeddings_regularizer": null}, "class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 6040, "trainable": true, "mask_zero": false, "embeddings_constraint": null, "activity_regularizer": null, "name": "embedding_2", "batch_input_shape": [null, 1], "output_dim": 128, "dtype": "int32", "input_length": 1, "embeddings_regularizer": null}, "class_name": "Embedding", "name": "embedding_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten", "name": "flatten_2", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"config": {"mode_type": "raw", "mode": "dot", "output_mask": null, "output_shape_type": "raw", "concat_axis": -1, "name": "merge_1", "arguments": {}, "dot_axes": [1, 1], "output_mask_type": "raw", "output_shape": null}, "class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["dropout_1", 0, 0, {"mask": [null, null]}], ["dropout_2", 0, 0, {"mask": [null, null]}]]]}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "name": "dense_1", "activation": "relu", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["merge_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Model"}