{"keras_version": "2.0.4", "class_name": "Model", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_length": 1, "mask_zero": false, "dtype": "int32", "output_dim": 256, "input_dim": 3952, "name": "embedding_1"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2", "class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_length": 1, "mask_zero": false, "dtype": "int32", "output_dim": 256, "input_dim": 6040, "name": "embedding_2"}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "movie_bias", "class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_length": 1, "mask_zero": false, "dtype": "int32", "output_dim": 1, "input_dim": 3952, "name": "movie_bias"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "users_bias", "class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 1], "input_length": 1, "mask_zero": false, "dtype": "int32", "output_dim": 1, "input_dim": 6040, "name": "users_bias"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {"mask": [null, null]}], ["dropout_2", 0, 0, {"mask": [null, null]}]]], "name": "merge_1", "class_name": "Merge", "config": {"output_mask": null, "mode_type": "raw", "output_shape": null, "mode": "dot", "output_mask_type": "raw", "concat_axis": -1, "dot_axes": [1, 1], "output_shape_type": "raw", "arguments": {}, "name": "merge_1"}}, {"inbound_nodes": [[["movie_bias", 0, 0, {}]]], "name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"inbound_nodes": [[["users_bias", 0, 0, {}]]], "name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"inbound_nodes": [[["merge_1", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null}}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow"}