{"keras_version": "2.0.4", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_2", "sparse": false}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"batch_input_shape": [null, 1], "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_length": 1, "input_dim": 3952, "embeddings_constraint": null, "activity_regularizer": null, "dtype": "int32", "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "output_dim": 256}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"batch_input_shape": [null, 1], "name": "embedding_2", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_length": 1, "input_dim": 6040, "embeddings_constraint": null, "activity_regularizer": null, "dtype": "int32", "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "output_dim": 256}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "name": "merge_1", "mode": "dot", "dot_axes": [1, 1], "arguments": {}, "concat_axis": -1, "output_shape": null, "output_mask": null, "mode_type": "raw"}, "inbound_nodes": [[["dropout_1", 0, 0, {"mask": [null, null]}], ["dropout_2", 0, 0, {"mask": [null, null]}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["merge_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "backend": "tensorflow"}